Loading files from: ../data/training_set/*/*.jpg
Image Shape: (256, 256, 3) | Generator Latent Dimension: 100 | Discriminator Latent Dimension: 20
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 64) 9472        input_3[0][0]                    
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 256, 256, 64) 128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 256, 256, 64) 0           instance_normalization_6[0][0]   
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 128, 128, 64) 0           activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 64, 128)  73856       average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 64, 64, 128)  256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 64, 128)  0           instance_normalization_7[0][0]   
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 32, 32, 128)  0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 256)  295168      average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 16, 16, 256)  512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 256)  0           instance_normalization_8[0][0]   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 65536)        0           activation_8[0][0]               
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 65537)        0           flatten_1[0][0]                  
                                                                 input_4[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          6553800     concatenate_3[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 65536)        6619136     dense_2[0][0]                    
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 16, 16, 256)  0           dense_3[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               multiple             0           reshape_1[0][0]                  
                                                                 concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 64, 64, 128)  73856       lambda_1[0][0]                   
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 64, 64, 128)  256         conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 64, 128)  0           instance_normalization_9[0][0]   
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 64, 64, 256)  0           activation_9[0][0]               
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 256, 256, 64) 36928       lambda_1[1][0]                   
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 256, 256, 64) 128         conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 256, 256, 64) 0           instance_normalization_10[0][0]  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 256, 256, 128 0           activation_10[0][0]              
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 256, 256, 3)  18819       concatenate_5[0][0]              
__________________________________________________________________________________________________
instance_normalization_11 (Inst (None, 256, 256, 3)  6           conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 256, 256, 3)  0           instance_normalization_11[0][0]  
==================================================================================================
Total params: 13,682,321
Trainable params: 13,682,321
Non-trainable params: 0
__________________________________________________________________________________________________
None
Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 64) 3136        input_5[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 128, 128, 64) 0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 128)  131200      leaky_re_lu[0][0]                
__________________________________________________________________________________________________
instance_normalization_12 (Inst (None, 64, 64, 128)  256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 64, 64, 128)  0           instance_normalization_12[0][0]  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 256)  524544      leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
instance_normalization_13 (Inst (None, 32, 32, 256)  512         conv2d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 32, 32, 256)  0           instance_normalization_13[0][0]  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 512)  2097664     leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
instance_normalization_14 (Inst (None, 16, 16, 512)  1024        conv2d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 16, 16, 512)  0           instance_normalization_14[0][0]  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 512)  4194816     leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
instance_normalization_15 (Inst (None, 16, 16, 512)  1024        conv2d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 16, 16, 512)  0           instance_normalization_15[0][0]  
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 131072)       0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 20)           2621460     flatten_2[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 20)           0           dense_4[0][0]                    
__________________________________________________________________________________________________
input_6 (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 21)           0           leaky_re_lu_5[0][0]              
                                                                 input_6[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 20)           440         concatenate_6[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 20)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 20)           420         leaky_re_lu_6[0][0]              
==================================================================================================
Total params: 9,576,496
Trainable params: 0
Non-trainable params: 9,576,496
__________________________________________________________________________________________________
None
